espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: read write control register */
/** Type of trace0_ctrl register
 *  trace0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_trace0 : R/W; bitpos: [0]; default: 1;
         *  Configures trace0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_trace0:1;
        /** read_ree0_trace0 : R/W; bitpos: [1]; default: 0;
         *  Configures trace0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_trace0:1;
        /** read_ree1_trace0 : R/W; bitpos: [2]; default: 0;
         *  Configures trace0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_trace0:1;
        /** read_ree2_trace0 : R/W; bitpos: [3]; default: 0;
         *  Configures trace0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_trace0:1;
        /** write_tee_trace0 : R/W; bitpos: [4]; default: 1;
         *  Configures trace0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_trace0:1;
        /** write_ree0_trace0 : R/W; bitpos: [5]; default: 0;
         *  Configures trace0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_trace0:1;
        /** write_ree1_trace0 : R/W; bitpos: [6]; default: 0;
         *  Configures trace0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_trace0:1;
        /** write_ree2_trace0 : R/W; bitpos: [7]; default: 0;
         *  Configures trace0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_trace0:1;
        /** trace0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock trace0 peri_apm configuration
         */
        uint32_t trace0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_trace0_ctrl_reg_t;

/** Type of trace1_ctrl register
 *  trace1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_trace1 : R/W; bitpos: [0]; default: 1;
         *  Configures trace1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_trace1:1;
        /** read_ree0_trace1 : R/W; bitpos: [1]; default: 0;
         *  Configures trace1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_trace1:1;
        /** read_ree1_trace1 : R/W; bitpos: [2]; default: 0;
         *  Configures trace1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_trace1:1;
        /** read_ree2_trace1 : R/W; bitpos: [3]; default: 0;
         *  Configures trace1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_trace1:1;
        /** write_tee_trace1 : R/W; bitpos: [4]; default: 1;
         *  Configures trace1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_trace1:1;
        /** write_ree0_trace1 : R/W; bitpos: [5]; default: 0;
         *  Configures trace1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_trace1:1;
        /** write_ree1_trace1 : R/W; bitpos: [6]; default: 0;
         *  Configures trace1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_trace1:1;
        /** write_ree2_trace1 : R/W; bitpos: [7]; default: 0;
         *  Configures trace1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_trace1:1;
        /** trace1_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock trace1 peri_apm configuration
         */
        uint32_t trace1_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_trace1_ctrl_reg_t;

/** Type of cpu_bus_mon_ctrl register
 *  cpu_bus_mon read/write control register
 */
typedef union {
    struct {
        /** read_tee_cpu_bus_mon : R/W; bitpos: [0]; default: 1;
         *  Configures cpu_bus_mon registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_cpu_bus_mon:1;
        /** read_ree0_cpu_bus_mon : R/W; bitpos: [1]; default: 0;
         *  Configures cpu_bus_mon registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_cpu_bus_mon:1;
        /** read_ree1_cpu_bus_mon : R/W; bitpos: [2]; default: 0;
         *  Configures cpu_bus_mon registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_cpu_bus_mon:1;
        /** read_ree2_cpu_bus_mon : R/W; bitpos: [3]; default: 0;
         *  Configures cpu_bus_mon registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_cpu_bus_mon:1;
        /** write_tee_cpu_bus_mon : R/W; bitpos: [4]; default: 1;
         *  Configures cpu_bus_mon registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_cpu_bus_mon:1;
        /** write_ree0_cpu_bus_mon : R/W; bitpos: [5]; default: 0;
         *  Configures cpu_bus_mon registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_cpu_bus_mon:1;
        /** write_ree1_cpu_bus_mon : R/W; bitpos: [6]; default: 0;
         *  Configures cpu_bus_mon registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_cpu_bus_mon:1;
        /** write_ree2_cpu_bus_mon : R/W; bitpos: [7]; default: 0;
         *  Configures cpu_bus_mon registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_cpu_bus_mon:1;
        /** cpu_bus_mon_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock cpu_bus_mon peri_apm configuration
         */
        uint32_t cpu_bus_mon_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_cpu_bus_mon_ctrl_reg_t;

/** Type of psram_mon_ctrl register
 *  psram_mon read/write control register
 */
typedef union {
    struct {
        /** read_tee_psram_mon : R/W; bitpos: [0]; default: 1;
         *  Configures psram_mon registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_psram_mon:1;
        /** read_ree0_psram_mon : R/W; bitpos: [1]; default: 0;
         *  Configures psram_mon registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_psram_mon:1;
        /** read_ree1_psram_mon : R/W; bitpos: [2]; default: 0;
         *  Configures psram_mon registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_psram_mon:1;
        /** read_ree2_psram_mon : R/W; bitpos: [3]; default: 0;
         *  Configures psram_mon registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_psram_mon:1;
        /** write_tee_psram_mon : R/W; bitpos: [4]; default: 1;
         *  Configures psram_mon registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_psram_mon:1;
        /** write_ree0_psram_mon : R/W; bitpos: [5]; default: 0;
         *  Configures psram_mon registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_psram_mon:1;
        /** write_ree1_psram_mon : R/W; bitpos: [6]; default: 0;
         *  Configures psram_mon registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_psram_mon:1;
        /** write_ree2_psram_mon : R/W; bitpos: [7]; default: 0;
         *  Configures psram_mon registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_psram_mon:1;
        /** psram_mon_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock psram_mon peri_apm configuration
         */
        uint32_t psram_mon_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_psram_mon_ctrl_reg_t;

/** Type of tcm_mon_ctrl register
 *  tcm_mon read/write control register
 */
typedef union {
    struct {
        /** read_tee_tcm_mon : R/W; bitpos: [0]; default: 1;
         *  Configures tcm_mon registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_tcm_mon:1;
        /** read_ree0_tcm_mon : R/W; bitpos: [1]; default: 0;
         *  Configures tcm_mon registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_tcm_mon:1;
        /** read_ree1_tcm_mon : R/W; bitpos: [2]; default: 0;
         *  Configures tcm_mon registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_tcm_mon:1;
        /** read_ree2_tcm_mon : R/W; bitpos: [3]; default: 0;
         *  Configures tcm_mon registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_tcm_mon:1;
        /** write_tee_tcm_mon : R/W; bitpos: [4]; default: 1;
         *  Configures tcm_mon registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_tcm_mon:1;
        /** write_ree0_tcm_mon : R/W; bitpos: [5]; default: 0;
         *  Configures tcm_mon registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_tcm_mon:1;
        /** write_ree1_tcm_mon : R/W; bitpos: [6]; default: 0;
         *  Configures tcm_mon registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_tcm_mon:1;
        /** write_ree2_tcm_mon : R/W; bitpos: [7]; default: 0;
         *  Configures tcm_mon registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_tcm_mon:1;
        /** tcm_mon_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock tcm_mon peri_apm configuration
         */
        uint32_t tcm_mon_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_tcm_mon_ctrl_reg_t;

/** Type of cache_ctrl register
 *  cache read/write control register
 */
typedef union {
    struct {
        /** read_tee_cache : R/W; bitpos: [0]; default: 1;
         *  Configures cache registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_cache:1;
        /** read_ree0_cache : R/W; bitpos: [1]; default: 0;
         *  Configures cache registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_cache:1;
        /** read_ree1_cache : R/W; bitpos: [2]; default: 0;
         *  Configures cache registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_cache:1;
        /** read_ree2_cache : R/W; bitpos: [3]; default: 0;
         *  Configures cache registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_cache:1;
        /** write_tee_cache : R/W; bitpos: [4]; default: 1;
         *  Configures cache registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_cache:1;
        /** write_ree0_cache : R/W; bitpos: [5]; default: 0;
         *  Configures cache registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_cache:1;
        /** write_ree1_cache : R/W; bitpos: [6]; default: 0;
         *  Configures cache registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_cache:1;
        /** write_ree2_cache : R/W; bitpos: [7]; default: 0;
         *  Configures cache registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_cache:1;
        /** cache_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock cache peri_apm configuration
         */
        uint32_t cache_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_cache_ctrl_reg_t;

/** Type of hp_usbotg_core_ctrl register
 *  hp_usbotg_core read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_usbotg_core : R/W; bitpos: [0]; default: 1;
         *  Configures hp_usbotg_core registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_usbotg_core:1;
        /** read_ree0_hp_usbotg_core : R/W; bitpos: [1]; default: 0;
         *  Configures hp_usbotg_core registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_usbotg_core:1;
        /** read_ree1_hp_usbotg_core : R/W; bitpos: [2]; default: 0;
         *  Configures hp_usbotg_core registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_usbotg_core:1;
        /** read_ree2_hp_usbotg_core : R/W; bitpos: [3]; default: 0;
         *  Configures hp_usbotg_core registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_usbotg_core:1;
        /** write_tee_hp_usbotg_core : R/W; bitpos: [4]; default: 1;
         *  Configures hp_usbotg_core registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_usbotg_core:1;
        /** write_ree0_hp_usbotg_core : R/W; bitpos: [5]; default: 0;
         *  Configures hp_usbotg_core registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_usbotg_core:1;
        /** write_ree1_hp_usbotg_core : R/W; bitpos: [6]; default: 0;
         *  Configures hp_usbotg_core registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_usbotg_core:1;
        /** write_ree2_hp_usbotg_core : R/W; bitpos: [7]; default: 0;
         *  Configures hp_usbotg_core registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_usbotg_core:1;
        /** hp_usbotg_core_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_usbotg_core peri_apm configuration
         */
        uint32_t hp_usbotg_core_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_usbotg_core_ctrl_reg_t;

/** Type of hp_regdma_ctrl register
 *  hp_regdma read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_regdma : R/W; bitpos: [0]; default: 1;
         *  Configures hp_regdma registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_regdma:1;
        /** read_ree0_hp_regdma : R/W; bitpos: [1]; default: 0;
         *  Configures hp_regdma registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_regdma:1;
        /** read_ree1_hp_regdma : R/W; bitpos: [2]; default: 0;
         *  Configures hp_regdma registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_regdma:1;
        /** read_ree2_hp_regdma : R/W; bitpos: [3]; default: 0;
         *  Configures hp_regdma registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_regdma:1;
        /** write_tee_hp_regdma : R/W; bitpos: [4]; default: 1;
         *  Configures hp_regdma registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_regdma:1;
        /** write_ree0_hp_regdma : R/W; bitpos: [5]; default: 0;
         *  Configures hp_regdma registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_regdma:1;
        /** write_ree1_hp_regdma : R/W; bitpos: [6]; default: 0;
         *  Configures hp_regdma registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_regdma:1;
        /** write_ree2_hp_regdma : R/W; bitpos: [7]; default: 0;
         *  Configures hp_regdma registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_regdma:1;
        /** hp_regdma_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_regdma peri_apm configuration
         */
        uint32_t hp_regdma_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_regdma_ctrl_reg_t;

