espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of hp_sdmmc_ctrl register
 *  hp_sdmmc read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_sdmmc : R/W; bitpos: [0]; default: 1;
         *  Configures hp_sdmmc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_sdmmc:1;
        /** read_ree0_hp_sdmmc : R/W; bitpos: [1]; default: 0;
         *  Configures hp_sdmmc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_sdmmc:1;
        /** read_ree1_hp_sdmmc : R/W; bitpos: [2]; default: 0;
         *  Configures hp_sdmmc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_sdmmc:1;
        /** read_ree2_hp_sdmmc : R/W; bitpos: [3]; default: 0;
         *  Configures hp_sdmmc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_sdmmc:1;
        /** write_tee_hp_sdmmc : R/W; bitpos: [4]; default: 1;
         *  Configures hp_sdmmc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_sdmmc:1;
        /** write_ree0_hp_sdmmc : R/W; bitpos: [5]; default: 0;
         *  Configures hp_sdmmc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_sdmmc:1;
        /** write_ree1_hp_sdmmc : R/W; bitpos: [6]; default: 0;
         *  Configures hp_sdmmc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_sdmmc:1;
        /** write_ree2_hp_sdmmc : R/W; bitpos: [7]; default: 0;
         *  Configures hp_sdmmc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_sdmmc:1;
        /** hp_sdmmc_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_sdmmc peri_apm configuration
         */
        uint32_t hp_sdmmc_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_sdmmc_ctrl_reg_t;

/** Type of hp_ahb_pdma_ctrl register
 *  hp_ahb_pdma read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_ahb_pdma : R/W; bitpos: [0]; default: 1;
         *  Configures hp_ahb_pdma registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_ahb_pdma:1;
        /** read_ree0_hp_ahb_pdma : R/W; bitpos: [1]; default: 0;
         *  Configures hp_ahb_pdma registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_ahb_pdma:1;
        /** read_ree1_hp_ahb_pdma : R/W; bitpos: [2]; default: 0;
         *  Configures hp_ahb_pdma registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_ahb_pdma:1;
        /** read_ree2_hp_ahb_pdma : R/W; bitpos: [3]; default: 0;
         *  Configures hp_ahb_pdma registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_ahb_pdma:1;
        /** write_tee_hp_ahb_pdma : R/W; bitpos: [4]; default: 1;
         *  Configures hp_ahb_pdma registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_ahb_pdma:1;
        /** write_ree0_hp_ahb_pdma : R/W; bitpos: [5]; default: 0;
         *  Configures hp_ahb_pdma registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_ahb_pdma:1;
        /** write_ree1_hp_ahb_pdma : R/W; bitpos: [6]; default: 0;
         *  Configures hp_ahb_pdma registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_ahb_pdma:1;
        /** write_ree2_hp_ahb_pdma : R/W; bitpos: [7]; default: 0;
         *  Configures hp_ahb_pdma registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_ahb_pdma:1;
        /** hp_ahb_pdma_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_ahb_pdma peri_apm configuration
         */
        uint32_t hp_ahb_pdma_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_ahb_pdma_ctrl_reg_t;

/** Type of hp_jpeg_ctrl register
 *  hp_jpeg read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_jpeg : R/W; bitpos: [0]; default: 1;
         *  Configures hp_jpeg registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_jpeg:1;
        /** read_ree0_hp_jpeg : R/W; bitpos: [1]; default: 0;
         *  Configures hp_jpeg registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_jpeg:1;
        /** read_ree1_hp_jpeg : R/W; bitpos: [2]; default: 0;
         *  Configures hp_jpeg registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_jpeg:1;
        /** read_ree2_hp_jpeg : R/W; bitpos: [3]; default: 0;
         *  Configures hp_jpeg registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_jpeg:1;
        /** write_tee_hp_jpeg : R/W; bitpos: [4]; default: 1;
         *  Configures hp_jpeg registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_jpeg:1;
        /** write_ree0_hp_jpeg : R/W; bitpos: [5]; default: 0;
         *  Configures hp_jpeg registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_jpeg:1;
        /** write_ree1_hp_jpeg : R/W; bitpos: [6]; default: 0;
         *  Configures hp_jpeg registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_jpeg:1;
        /** write_ree2_hp_jpeg : R/W; bitpos: [7]; default: 0;
         *  Configures hp_jpeg registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_jpeg:1;
        /** hp_jpeg_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_jpeg peri_apm configuration
         */
        uint32_t hp_jpeg_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_jpeg_ctrl_reg_t;

