espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of hp_ppa_ctrl register
 *  hp_ppa read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_ppa : R/W; bitpos: [0]; default: 1;
         *  Configures hp_ppa registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_ppa:1;
        /** read_ree0_hp_ppa : R/W; bitpos: [1]; default: 0;
         *  Configures hp_ppa registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_ppa:1;
        /** read_ree1_hp_ppa : R/W; bitpos: [2]; default: 0;
         *  Configures hp_ppa registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_ppa:1;
        /** read_ree2_hp_ppa : R/W; bitpos: [3]; default: 0;
         *  Configures hp_ppa registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_ppa:1;
        /** write_tee_hp_ppa : R/W; bitpos: [4]; default: 1;
         *  Configures hp_ppa registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_ppa:1;
        /** write_ree0_hp_ppa : R/W; bitpos: [5]; default: 0;
         *  Configures hp_ppa registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_ppa:1;
        /** write_ree1_hp_ppa : R/W; bitpos: [6]; default: 0;
         *  Configures hp_ppa registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_ppa:1;
        /** write_ree2_hp_ppa : R/W; bitpos: [7]; default: 0;
         *  Configures hp_ppa registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_ppa:1;
        /** hp_ppa_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_ppa peri_apm configuration
         */
        uint32_t hp_ppa_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_ppa_ctrl_reg_t;

/** Type of hp_dma2d_ctrl register
 *  hp_dma2d read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_dma2d : R/W; bitpos: [0]; default: 1;
         *  Configures hp_dma2d registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_dma2d:1;
        /** read_ree0_hp_dma2d : R/W; bitpos: [1]; default: 0;
         *  Configures hp_dma2d registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_dma2d:1;
        /** read_ree1_hp_dma2d : R/W; bitpos: [2]; default: 0;
         *  Configures hp_dma2d registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_dma2d:1;
        /** read_ree2_hp_dma2d : R/W; bitpos: [3]; default: 0;
         *  Configures hp_dma2d registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_dma2d:1;
        /** write_tee_hp_dma2d : R/W; bitpos: [4]; default: 1;
         *  Configures hp_dma2d registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_dma2d:1;
        /** write_ree0_hp_dma2d : R/W; bitpos: [5]; default: 0;
         *  Configures hp_dma2d registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_dma2d:1;
        /** write_ree1_hp_dma2d : R/W; bitpos: [6]; default: 0;
         *  Configures hp_dma2d registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_dma2d:1;
        /** write_ree2_hp_dma2d : R/W; bitpos: [7]; default: 0;
         *  Configures hp_dma2d registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_dma2d:1;
        /** hp_dma2d_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_dma2d peri_apm configuration
         */
        uint32_t hp_dma2d_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_dma2d_ctrl_reg_t;

/** Type of hp_axi_pdma_ctrl register
 *  hp_axi_pdma read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_axi_pdma : R/W; bitpos: [0]; default: 1;
         *  Configures hp_axi_pdma registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_axi_pdma:1;
        /** read_ree0_hp_axi_pdma : R/W; bitpos: [1]; default: 0;
         *  Configures hp_axi_pdma registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_axi_pdma:1;
        /** read_ree1_hp_axi_pdma : R/W; bitpos: [2]; default: 0;
         *  Configures hp_axi_pdma registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_axi_pdma:1;
        /** read_ree2_hp_axi_pdma : R/W; bitpos: [3]; default: 0;
         *  Configures hp_axi_pdma registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_axi_pdma:1;
        /** write_tee_hp_axi_pdma : R/W; bitpos: [4]; default: 1;
         *  Configures hp_axi_pdma registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_axi_pdma:1;
        /** write_ree0_hp_axi_pdma : R/W; bitpos: [5]; default: 0;
         *  Configures hp_axi_pdma registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_axi_pdma:1;
        /** write_ree1_hp_axi_pdma : R/W; bitpos: [6]; default: 0;
         *  Configures hp_axi_pdma registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_axi_pdma:1;
        /** write_ree2_hp_axi_pdma : R/W; bitpos: [7]; default: 0;
         *  Configures hp_axi_pdma registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_axi_pdma:1;
        /** hp_axi_pdma_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_axi_pdma peri_apm configuration
         */
        uint32_t hp_axi_pdma_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_axi_pdma_ctrl_reg_t;

/** Type of hp_gmac_ctrl register
 *  hp_gmac read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_gmac : R/W; bitpos: [0]; default: 1;
         *  Configures hp_gmac registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_gmac:1;
        /** read_ree0_hp_gmac : R/W; bitpos: [1]; default: 0;
         *  Configures hp_gmac registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_gmac:1;
        /** read_ree1_hp_gmac : R/W; bitpos: [2]; default: 0;
         *  Configures hp_gmac registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_gmac:1;
        /** read_ree2_hp_gmac : R/W; bitpos: [3]; default: 0;
         *  Configures hp_gmac registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_gmac:1;
        /** write_tee_hp_gmac : R/W; bitpos: [4]; default: 1;
         *  Configures hp_gmac registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_gmac:1;
        /** write_ree0_hp_gmac : R/W; bitpos: [5]; default: 0;
         *  Configures hp_gmac registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_gmac:1;
        /** write_ree1_hp_gmac : R/W; bitpos: [6]; default: 0;
         *  Configures hp_gmac registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_gmac:1;
        /** write_ree2_hp_gmac : R/W; bitpos: [7]; default: 0;
         *  Configures hp_gmac registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_gmac:1;
        /** hp_gmac_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_gmac peri_apm configuration
         */
        uint32_t hp_gmac_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_gmac_ctrl_reg_t;

/** Type of hp_pvt0_ctrl register
 *  hp_pvt0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_pvt0 : R/W; bitpos: [0]; default: 1;
         *  Configures hp_pvt0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_pvt0:1;
        /** read_ree0_hp_pvt0 : R/W; bitpos: [1]; default: 0;
         *  Configures hp_pvt0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_pvt0:1;
        /** read_ree1_hp_pvt0 : R/W; bitpos: [2]; default: 0;
         *  Configures hp_pvt0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_pvt0:1;
        /** read_ree2_hp_pvt0 : R/W; bitpos: [3]; default: 0;
         *  Configures hp_pvt0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_pvt0:1;
        /** write_tee_hp_pvt0 : R/W; bitpos: [4]; default: 1;
         *  Configures hp_pvt0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_pvt0:1;
        /** write_ree0_hp_pvt0 : R/W; bitpos: [5]; default: 0;
         *  Configures hp_pvt0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_pvt0:1;
        /** write_ree1_hp_pvt0 : R/W; bitpos: [6]; default: 0;
         *  Configures hp_pvt0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_pvt0:1;
        /** write_ree2_hp_pvt0 : R/W; bitpos: [7]; default: 0;
         *  Configures hp_pvt0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_pvt0:1;
        /** hp_pvt0_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_pvt0 peri_apm configuration
         */
        uint32_t hp_pvt0_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_pvt0_ctrl_reg_t;

