espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of hp_rmt_ctrl register
 *  hp_rmt read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_rmt : R/W; bitpos: [0]; default: 1;
         *  Configures hp_rmt registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_rmt:1;
        /** read_ree0_hp_rmt : R/W; bitpos: [1]; default: 0;
         *  Configures hp_rmt registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_rmt:1;
        /** read_ree1_hp_rmt : R/W; bitpos: [2]; default: 0;
         *  Configures hp_rmt registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_rmt:1;
        /** read_ree2_hp_rmt : R/W; bitpos: [3]; default: 0;
         *  Configures hp_rmt registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_rmt:1;
        /** write_tee_hp_rmt : R/W; bitpos: [4]; default: 1;
         *  Configures hp_rmt registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_rmt:1;
        /** write_ree0_hp_rmt : R/W; bitpos: [5]; default: 0;
         *  Configures hp_rmt registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_rmt:1;
        /** write_ree1_hp_rmt : R/W; bitpos: [6]; default: 0;
         *  Configures hp_rmt registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_rmt:1;
        /** write_ree2_hp_rmt : R/W; bitpos: [7]; default: 0;
         *  Configures hp_rmt registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_rmt:1;
        /** hp_rmt_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_rmt peri_apm configuration
         */
        uint32_t hp_rmt_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_rmt_ctrl_reg_t;

/** Type of hp_bitsrambler_ctrl register
 *  hp_bitsrambler read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_bitsrambler : R/W; bitpos: [0]; default: 1;
         *  Configures hp_bitsrambler registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_bitsrambler:1;
        /** read_ree0_hp_bitsrambler : R/W; bitpos: [1]; default: 0;
         *  Configures hp_bitsrambler registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_bitsrambler:1;
        /** read_ree1_hp_bitsrambler : R/W; bitpos: [2]; default: 0;
         *  Configures hp_bitsrambler registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_bitsrambler:1;
        /** read_ree2_hp_bitsrambler : R/W; bitpos: [3]; default: 0;
         *  Configures hp_bitsrambler registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_bitsrambler:1;
        /** write_tee_hp_bitsrambler : R/W; bitpos: [4]; default: 1;
         *  Configures hp_bitsrambler registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_bitsrambler:1;
        /** write_ree0_hp_bitsrambler : R/W; bitpos: [5]; default: 0;
         *  Configures hp_bitsrambler registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_bitsrambler:1;
        /** write_ree1_hp_bitsrambler : R/W; bitpos: [6]; default: 0;
         *  Configures hp_bitsrambler registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_bitsrambler:1;
        /** write_ree2_hp_bitsrambler : R/W; bitpos: [7]; default: 0;
         *  Configures hp_bitsrambler registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_bitsrambler:1;
        /** hp_bitsrambler_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_bitsrambler peri_apm configuration
         */
        uint32_t hp_bitsrambler_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_bitsrambler_ctrl_reg_t;

/** Type of hp_asrc_ctrl register
 *  hp_asrc read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_asrc : R/W; bitpos: [0]; default: 1;
         *  Configures hp_asrc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_asrc:1;
        /** read_ree0_hp_asrc : R/W; bitpos: [1]; default: 0;
         *  Configures hp_asrc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_asrc:1;
        /** read_ree1_hp_asrc : R/W; bitpos: [2]; default: 0;
         *  Configures hp_asrc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_asrc:1;
        /** read_ree2_hp_asrc : R/W; bitpos: [3]; default: 0;
         *  Configures hp_asrc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_asrc:1;
        /** write_tee_hp_asrc : R/W; bitpos: [4]; default: 1;
         *  Configures hp_asrc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_asrc:1;
        /** write_ree0_hp_asrc : R/W; bitpos: [5]; default: 0;
         *  Configures hp_asrc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_asrc:1;
        /** write_ree1_hp_asrc : R/W; bitpos: [6]; default: 0;
         *  Configures hp_asrc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_asrc:1;
        /** write_ree2_hp_asrc : R/W; bitpos: [7]; default: 0;
         *  Configures hp_asrc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_asrc:1;
        /** hp_asrc_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_asrc peri_apm configuration
         */
        uint32_t hp_asrc_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_asrc_ctrl_reg_t;

