espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of cnnt_sys_reg_ctrl register
 *  cnnt_sys_reg read/write control register
 */
typedef union {
    struct {
        /** read_tee_cnnt_sys_reg : R/W; bitpos: [0]; default: 1;
         *  Configures cnnt_sys_reg registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_cnnt_sys_reg:1;
        /** read_ree0_cnnt_sys_reg : R/W; bitpos: [1]; default: 0;
         *  Configures cnnt_sys_reg registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_cnnt_sys_reg:1;
        /** read_ree1_cnnt_sys_reg : R/W; bitpos: [2]; default: 0;
         *  Configures cnnt_sys_reg registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_cnnt_sys_reg:1;
        /** read_ree2_cnnt_sys_reg : R/W; bitpos: [3]; default: 0;
         *  Configures cnnt_sys_reg registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_cnnt_sys_reg:1;
        /** write_tee_cnnt_sys_reg : R/W; bitpos: [4]; default: 1;
         *  Configures cnnt_sys_reg registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_cnnt_sys_reg:1;
        /** write_ree0_cnnt_sys_reg : R/W; bitpos: [5]; default: 0;
         *  Configures cnnt_sys_reg registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_cnnt_sys_reg:1;
        /** write_ree1_cnnt_sys_reg : R/W; bitpos: [6]; default: 0;
         *  Configures cnnt_sys_reg registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_cnnt_sys_reg:1;
        /** write_ree2_cnnt_sys_reg : R/W; bitpos: [7]; default: 0;
         *  Configures cnnt_sys_reg registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_cnnt_sys_reg:1;
        /** cnnt_sys_reg_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock cnnt_sys_reg peri_apm configuration
         */
        uint32_t cnnt_sys_reg_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_cnnt_sys_reg_ctrl_reg_t;

/** Type of hp_flash_ctrl register
 *  hp_flash read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_flash : R/W; bitpos: [0]; default: 1;
         *  Configures hp_flash registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_flash:1;
        /** read_ree0_hp_flash : R/W; bitpos: [1]; default: 0;
         *  Configures hp_flash registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_flash:1;
        /** read_ree1_hp_flash : R/W; bitpos: [2]; default: 0;
         *  Configures hp_flash registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_flash:1;
        /** read_ree2_hp_flash : R/W; bitpos: [3]; default: 0;
         *  Configures hp_flash registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_flash:1;
        /** write_tee_hp_flash : R/W; bitpos: [4]; default: 1;
         *  Configures hp_flash registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_flash:1;
        /** write_ree0_hp_flash : R/W; bitpos: [5]; default: 0;
         *  Configures hp_flash registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_flash:1;
        /** write_ree1_hp_flash : R/W; bitpos: [6]; default: 0;
         *  Configures hp_flash registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_flash:1;
        /** write_ree2_hp_flash : R/W; bitpos: [7]; default: 0;
         *  Configures hp_flash registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_flash:1;
        /** hp_flash_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_flash peri_apm configuration
         */
        uint32_t hp_flash_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_flash_ctrl_reg_t;

/** Type of hp_psram_ctrl register
 *  hp_psram read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_psram : R/W; bitpos: [0]; default: 1;
         *  Configures hp_psram registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_psram:1;
        /** read_ree0_hp_psram : R/W; bitpos: [1]; default: 0;
         *  Configures hp_psram registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_psram:1;
        /** read_ree1_hp_psram : R/W; bitpos: [2]; default: 0;
         *  Configures hp_psram registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_psram:1;
        /** read_ree2_hp_psram : R/W; bitpos: [3]; default: 0;
         *  Configures hp_psram registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_psram:1;
        /** write_tee_hp_psram : R/W; bitpos: [4]; default: 1;
         *  Configures hp_psram registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_psram:1;
        /** write_ree0_hp_psram : R/W; bitpos: [5]; default: 0;
         *  Configures hp_psram registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_psram:1;
        /** write_ree1_hp_psram : R/W; bitpos: [6]; default: 0;
         *  Configures hp_psram registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_psram:1;
        /** write_ree2_hp_psram : R/W; bitpos: [7]; default: 0;
         *  Configures hp_psram registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_psram:1;
        /** hp_psram_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_psram peri_apm configuration
         */
        uint32_t hp_psram_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_psram_ctrl_reg_t;

