espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of hp_peri0_pms_ctrl register
 *  hp_peri0_pms read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_peri0_pms : R/W; bitpos: [0]; default: 1;
         *  Configures hp_peri0_pms registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_peri0_pms:1;
        /** read_ree0_hp_peri0_pms : HRO; bitpos: [1]; default: 0;
         *  Configures hp_peri0_pms registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_peri0_pms:1;
        /** read_ree1_hp_peri0_pms : HRO; bitpos: [2]; default: 0;
         *  Configures hp_peri0_pms registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_peri0_pms:1;
        /** read_ree2_hp_peri0_pms : HRO; bitpos: [3]; default: 0;
         *  Configures hp_peri0_pms registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_peri0_pms:1;
        /** write_tee_hp_peri0_pms : R/W; bitpos: [4]; default: 1;
         *  Configures hp_peri0_pms registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_peri0_pms:1;
        /** write_ree0_hp_peri0_pms : HRO; bitpos: [5]; default: 0;
         *  Configures hp_peri0_pms registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_peri0_pms:1;
        /** write_ree1_hp_peri0_pms : HRO; bitpos: [6]; default: 0;
         *  Configures hp_peri0_pms registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_peri0_pms:1;
        /** write_ree2_hp_peri0_pms : HRO; bitpos: [7]; default: 0;
         *  Configures hp_peri0_pms registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_peri0_pms:1;
        /** hp_peri0_pms_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_peri0_pms peri_apm configuration
         */
        uint32_t hp_peri0_pms_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_peri0_pms_ctrl_reg_t;

/** Type of hp_key_manager_ctrl register
 *  hp_key_manager read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_key_manager : R/W; bitpos: [0]; default: 1;
         *  Configures hp_key_manager registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_key_manager:1;
        /** read_ree0_hp_key_manager : R/W; bitpos: [1]; default: 0;
         *  Configures hp_key_manager registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_key_manager:1;
        /** read_ree1_hp_key_manager : R/W; bitpos: [2]; default: 0;
         *  Configures hp_key_manager registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_key_manager:1;
        /** read_ree2_hp_key_manager : R/W; bitpos: [3]; default: 0;
         *  Configures hp_key_manager registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_key_manager:1;
        /** write_tee_hp_key_manager : R/W; bitpos: [4]; default: 1;
         *  Configures hp_key_manager registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_key_manager:1;
        /** write_ree0_hp_key_manager : R/W; bitpos: [5]; default: 0;
         *  Configures hp_key_manager registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_key_manager:1;
        /** write_ree1_hp_key_manager : R/W; bitpos: [6]; default: 0;
         *  Configures hp_key_manager registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_key_manager:1;
        /** write_ree2_hp_key_manager : R/W; bitpos: [7]; default: 0;
         *  Configures hp_key_manager registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_key_manager:1;
        /** hp_key_manager_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_key_manager peri_apm configuration
         */
        uint32_t hp_key_manager_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_key_manager_ctrl_reg_t;

/** Type of hp_crypto_ctrl register
 *  hp_crypto read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_crypto : R/W; bitpos: [0]; default: 1;
         *  Configures hp_crypto registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_crypto:1;
        /** read_ree0_hp_crypto : R/W; bitpos: [1]; default: 0;
         *  Configures hp_crypto registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_crypto:1;
        /** read_ree1_hp_crypto : R/W; bitpos: [2]; default: 0;
         *  Configures hp_crypto registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_crypto:1;
        /** read_ree2_hp_crypto : R/W; bitpos: [3]; default: 0;
         *  Configures hp_crypto registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_crypto:1;
        /** write_tee_hp_crypto : R/W; bitpos: [4]; default: 1;
         *  Configures hp_crypto registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_crypto:1;
        /** write_ree0_hp_crypto : R/W; bitpos: [5]; default: 0;
         *  Configures hp_crypto registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_crypto:1;
        /** write_ree1_hp_crypto : R/W; bitpos: [6]; default: 0;
         *  Configures hp_crypto registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_crypto:1;
        /** write_ree2_hp_crypto : R/W; bitpos: [7]; default: 0;
         *  Configures hp_crypto registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_crypto:1;
        /** hp_crypto_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_crypto peri_apm configuration
         */
        uint32_t hp_crypto_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_crypto_ctrl_reg_t;

