espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of hp_axi_icm_ctrl register
 *  hp_axi_icm read/write control register
 */
typedef union {
    struct {
        /** read_tee_hp_axi_icm : R/W; bitpos: [0]; default: 1;
         *  Configures hp_axi_icm registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_hp_axi_icm:1;
        /** read_ree0_hp_axi_icm : R/W; bitpos: [1]; default: 0;
         *  Configures hp_axi_icm registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_hp_axi_icm:1;
        /** read_ree1_hp_axi_icm : R/W; bitpos: [2]; default: 0;
         *  Configures hp_axi_icm registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_hp_axi_icm:1;
        /** read_ree2_hp_axi_icm : R/W; bitpos: [3]; default: 0;
         *  Configures hp_axi_icm registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_hp_axi_icm:1;
        /** write_tee_hp_axi_icm : R/W; bitpos: [4]; default: 1;
         *  Configures hp_axi_icm registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_hp_axi_icm:1;
        /** write_ree0_hp_axi_icm : R/W; bitpos: [5]; default: 0;
         *  Configures hp_axi_icm registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_hp_axi_icm:1;
        /** write_ree1_hp_axi_icm : R/W; bitpos: [6]; default: 0;
         *  Configures hp_axi_icm registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_hp_axi_icm:1;
        /** write_ree2_hp_axi_icm : R/W; bitpos: [7]; default: 0;
         *  Configures hp_axi_icm registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_hp_axi_icm:1;
        /** hp_axi_icm_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock hp_axi_icm peri_apm configuration
         */
        uint32_t hp_axi_icm_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_hp_axi_icm_ctrl_reg_t;

/** Type of axi_perf_mon_ctrl register
 *  axi_perf_mon read/write control register
 */
typedef union {
    struct {
        /** read_tee_axi_perf_mon : R/W; bitpos: [0]; default: 1;
         *  Configures axi_perf_mon registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_axi_perf_mon:1;
        /** read_ree0_axi_perf_mon : R/W; bitpos: [1]; default: 0;
         *  Configures axi_perf_mon registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_axi_perf_mon:1;
        /** read_ree1_axi_perf_mon : R/W; bitpos: [2]; default: 0;
         *  Configures axi_perf_mon registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_axi_perf_mon:1;
        /** read_ree2_axi_perf_mon : R/W; bitpos: [3]; default: 0;
         *  Configures axi_perf_mon registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_axi_perf_mon:1;
        /** write_tee_axi_perf_mon : R/W; bitpos: [4]; default: 1;
         *  Configures axi_perf_mon registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_axi_perf_mon:1;
        /** write_ree0_axi_perf_mon : R/W; bitpos: [5]; default: 0;
         *  Configures axi_perf_mon registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_axi_perf_mon:1;
        /** write_ree1_axi_perf_mon : R/W; bitpos: [6]; default: 0;
         *  Configures axi_perf_mon registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_axi_perf_mon:1;
        /** write_ree2_axi_perf_mon : R/W; bitpos: [7]; default: 0;
         *  Configures axi_perf_mon registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_axi_perf_mon:1;
        /** axi_perf_mon_lock : R/W; bitpos: [8]; default: 0;
         *  Set 1 to lock axi_perf_mon peri_apm configuration
         */
        uint32_t axi_perf_mon_lock:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_peri0_pms_axi_perf_mon_ctrl_reg_t;


/** Group: PMS Register */
/** Type of hp_cpuperi0_0 register
 *  HP_CPUPERI0 PMS configuration & info register
 */
typedef union {
    struct {
        /** hp_cpuperi0_pms_exception_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear hp_cpuperi0 peri_pms_record_reg.
         *  0: No clear
         *  1: Clear peri_pms_record_reg
         */
        uint32_t hp_cpuperi0_pms_exception_clr:1;
        /** hp_cpuperi0_pms_exception_det : RO; bitpos: [1]; default: 0;
         *  Represents whether the hp_cpuperi0 pms has been triggered.
         *  0: No triggered
         *  1: Has been triggered
         */
        uint32_t hp_cpuperi0_pms_exception_det:1;
        /** hp_cpuperi0_pms_exception_id : RO; bitpos: [7:2]; default: 0;
         *  Represents the master id when hp_cpuperi0 pms has been triggered.
         */
        uint32_t hp_cpuperi0_pms_exception_id:6;
        /** hp_cpuperi0_pms_exception_mode : RO; bitpos: [9:8]; default: 0;
         *  Represents the security mode when hp_cpuperi0 pms has been triggered.
         */
        uint32_t hp_cpuperi0_pms_exception_mode:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_peri0_pms_hp_cpuperi0_0_reg_t;

