espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
/** Type of hp_cpuperi0_1 register
 *  HP_CPUPERI0 PMS exception addr record register
 */
typedef union {
    struct {
        /** hp_cpuperi0_pms_exception_addr : RO; bitpos: [27:0]; default: 0;
         *  Represents the access address (bit27~bit0) when hp_cpuperi0 pms has been triggered.
         */
        uint32_t hp_cpuperi0_pms_exception_addr:28;
        /** hp_cpuperi0_pms_exception_addr_const : HRO; bitpos: [31:28]; default: 2;
         *  Represents the access address (bit31~bit28) when hp_cpuperi0 pms has been triggered.
         */
        uint32_t hp_cpuperi0_pms_exception_addr_const:4;
    };
    uint32_t val;
} hp_peri0_pms_hp_cpuperi0_1_reg_t;

/** Type of hp_cpuperi1_0 register
 *  HP_CPUPERI1 PMS configuration & info register
 */
typedef union {
    struct {
        /** hp_cpuperi1_pms_exception_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear hp_cpuperi1 peri_pms_record_reg.
         *  0: No clear
         *  1: Clear peri_pms_record_reg
         */
        uint32_t hp_cpuperi1_pms_exception_clr:1;
        /** hp_cpuperi1_pms_exception_det : RO; bitpos: [1]; default: 0;
         *  Represents whether the hp_cpuperi1 pms has been triggered.
         *  0: No triggered
         *  1: Has been triggered
         */
        uint32_t hp_cpuperi1_pms_exception_det:1;
        /** hp_cpuperi1_pms_exception_id : RO; bitpos: [7:2]; default: 0;
         *  Represents the master id when hp_cpuperi1 pms has been triggered.
         */
        uint32_t hp_cpuperi1_pms_exception_id:6;
        /** hp_cpuperi1_pms_exception_mode : RO; bitpos: [9:8]; default: 0;
         *  Represents the security mode when hp_cpuperi1 pms has been triggered.
         */
        uint32_t hp_cpuperi1_pms_exception_mode:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_peri0_pms_hp_cpuperi1_0_reg_t;

/** Type of hp_cpuperi1_1 register
 *  HP_CPUPERI1 PMS exception addr record register
 */
typedef union {
    struct {
        /** hp_cpuperi1_pms_exception_addr : RO; bitpos: [27:0]; default: 0;
         *  Represents the access address (bit27~bit0) when hp_cpuperi1 pms has been triggered.
         */
        uint32_t hp_cpuperi1_pms_exception_addr:28;
        /** hp_cpuperi1_pms_exception_addr_const : HRO; bitpos: [31:28]; default: 2;
         *  Represents the access address (bit31~bit28) when hp_cpuperi1 pms has been triggered.
         */
        uint32_t hp_cpuperi1_pms_exception_addr_const:4;
    };
    uint32_t val;
} hp_peri0_pms_hp_cpuperi1_1_reg_t;

/** Type of hp_peri0_0 register
 *  HP_PERI0 PMS configuration & info register
 */
typedef union {
    struct {
        /** hp_peri0_pms_exception_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear hp_peri0 peri_pms_record_reg.
         *  0: No clear
         *  1: Clear peri_pms_record_reg
         */
        uint32_t hp_peri0_pms_exception_clr:1;
        /** hp_peri0_pms_exception_det : RO; bitpos: [1]; default: 0;
         *  Represents whether the hp_peri0 pms has been triggered.
         *  0: No triggered
         *  1: Has been triggered
         */
        uint32_t hp_peri0_pms_exception_det:1;
        /** hp_peri0_pms_exception_id : RO; bitpos: [7:2]; default: 0;
         *  Represents the master id when hp_peri0 pms has been triggered.
         */
        uint32_t hp_peri0_pms_exception_id:6;
        /** hp_peri0_pms_exception_mode : RO; bitpos: [9:8]; default: 0;
         *  Represents the security mode when hp_peri0 pms has been triggered.
         */
        uint32_t hp_peri0_pms_exception_mode:2;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_peri0_pms_hp_peri0_0_reg_t;

/** Type of hp_peri0_1 register
 *  HP_PERI0 PMS exception addr record register
 */
typedef union {
    struct {
        /** hp_peri0_pms_exception_addr : RO; bitpos: [27:0]; default: 0;
         *  Represents the access address (bit27~bit0) when hp_peri0 pms has been triggered.
         */
        uint32_t hp_peri0_pms_exception_addr:28;
        /** hp_peri0_pms_exception_addr_const : HRO; bitpos: [31:28]; default: 2;
         *  Represents the access address (bit31~bit28) when hp_peri0 pms has been triggered.
         */
        uint32_t hp_peri0_pms_exception_addr_const:4;
    };
    uint32_t val;
} hp_peri0_pms_hp_peri0_1_reg_t;

/** Type of int_en register
 *  APM interrupt enable register
 */
typedef union {
    struct {
        /** hp_peri0_pms_int_en : R/W; bitpos: [0]; default: 0;
         *  Configures to enable hp_peri0 pms interrupt.
         *  0: disable
         *  1: enable
         */
        uint32_t hp_peri0_pms_int_en:1;
        /** hp_cpuperi1_pms_int_en : R/W; bitpos: [1]; default: 0;
         *  Configures to enable hp_cpuperi1 pms interrupt.
         *  0: disable
         *  1: enable
         */
        uint32_t hp_cpuperi1_pms_int_en:1;
        /** hp_cpuperi0_pms_int_en : R/W; bitpos: [2]; default: 0;
         *  Configures to enable hp_cpuperi0 pms interrupt.
         *  0: disable
         *  1: enable
         */
        uint32_t hp_cpuperi0_pms_int_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_peri0_pms_int_en_reg_t;


/** Group: config register */
/** Type of bus_err_conf register
 *  Clock gating register
 */
typedef union {
    struct {
        /** bus_err_resp_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether return error response to cpu when access blocked
         *  0: disable error response
         *  1: enable error response
         */
        uint32_t bus_err_resp_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_peri0_pms_bus_err_conf_reg_t;


/** Group: clock gating register */
/** Type of clock_gate register
 *  Clock gating register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  Configures whether to keep the clock always on.
         *  0: enable automatic clock gating
         *  1: keep the clock always on
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_peri0_pms_clock_gate_reg_t;


/** Group: Version control register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 38834736;
         *  Version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_peri0_pms_date_reg_t;


