espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_struct.h
typedef struct {
    volatile hp_peri0_pms_trace0_ctrl_reg_t trace0_ctrl;
    volatile hp_peri0_pms_trace1_ctrl_reg_t trace1_ctrl;
    volatile hp_peri0_pms_cpu_bus_mon_ctrl_reg_t cpu_bus_mon_ctrl;
    volatile hp_peri0_pms_psram_mon_ctrl_reg_t psram_mon_ctrl;
    volatile hp_peri0_pms_tcm_mon_ctrl_reg_t tcm_mon_ctrl;
    volatile hp_peri0_pms_cache_ctrl_reg_t cache_ctrl;
    volatile hp_peri0_pms_hp_usbotg_core_ctrl_reg_t hp_usbotg_core_ctrl;
    volatile hp_peri0_pms_hp_regdma_ctrl_reg_t hp_regdma_ctrl;
    volatile hp_peri0_pms_hp_sdmmc_ctrl_reg_t hp_sdmmc_ctrl;
    volatile hp_peri0_pms_hp_ahb_pdma_ctrl_reg_t hp_ahb_pdma_ctrl;
    volatile hp_peri0_pms_hp_jpeg_ctrl_reg_t hp_jpeg_ctrl;
    volatile hp_peri0_pms_hp_ppa_ctrl_reg_t hp_ppa_ctrl;
    volatile hp_peri0_pms_hp_dma2d_ctrl_reg_t hp_dma2d_ctrl;
    volatile hp_peri0_pms_hp_axi_pdma_ctrl_reg_t hp_axi_pdma_ctrl;
    volatile hp_peri0_pms_hp_gmac_ctrl_reg_t hp_gmac_ctrl;
    volatile hp_peri0_pms_hp_pvt0_ctrl_reg_t hp_pvt0_ctrl;
    volatile hp_peri0_pms_hp_rmt_ctrl_reg_t hp_rmt_ctrl;
    volatile hp_peri0_pms_hp_bitsrambler_ctrl_reg_t hp_bitsrambler_ctrl;
    volatile hp_peri0_pms_hp_asrc_ctrl_reg_t hp_asrc_ctrl;
    volatile hp_peri0_pms_cnnt_sys_reg_ctrl_reg_t cnnt_sys_reg_ctrl;
    volatile hp_peri0_pms_hp_flash_ctrl_reg_t hp_flash_ctrl;
    volatile hp_peri0_pms_hp_psram_ctrl_reg_t hp_psram_ctrl;
    volatile hp_peri0_pms_tee_ctrl_reg_t tee_ctrl;
    volatile hp_peri0_pms_hp_apm_ctrl_reg_t hp_apm_ctrl;
    volatile hp_peri0_pms_hp_mem_apm_ctrl_reg_t hp_mem_apm_ctrl;
    volatile hp_peri0_pms_cpu_apm_ctrl_reg_t cpu_apm_ctrl;
    volatile hp_peri0_pms_hp_peri0_pms_ctrl_reg_t hp_peri0_pms_ctrl;
    volatile hp_peri0_pms_hp_key_manager_ctrl_reg_t hp_key_manager_ctrl;
    volatile hp_peri0_pms_hp_crypto_ctrl_reg_t hp_crypto_ctrl;
    volatile hp_peri0_pms_hp_axi_icm_ctrl_reg_t hp_axi_icm_ctrl;
    volatile hp_peri0_pms_axi_perf_mon_ctrl_reg_t axi_perf_mon_ctrl;
    uint32_t reserved_07c[97];
    volatile hp_peri0_pms_hp_cpuperi0_0_reg_t hp_cpuperi0_0;
    volatile hp_peri0_pms_hp_cpuperi0_1_reg_t hp_cpuperi0_1;
    volatile hp_peri0_pms_hp_cpuperi1_0_reg_t hp_cpuperi1_0;
    volatile hp_peri0_pms_hp_cpuperi1_1_reg_t hp_cpuperi1_1;
    volatile hp_peri0_pms_hp_peri0_0_reg_t hp_peri0_0;
    volatile hp_peri0_pms_hp_peri0_1_reg_t hp_peri0_1;
    uint32_t reserved_218[58];
    volatile hp_peri0_pms_int_en_reg_t int_en;
    uint32_t reserved_304[827];
    volatile hp_peri0_pms_bus_err_conf_reg_t bus_err_conf;
    uint32_t reserved_ff4;
    volatile hp_peri0_pms_clock_gate_reg_t clock_gate;
    volatile hp_peri0_pms_date_reg_t date;
} hp_peri0_pms_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(hp_peri0_pms_dev_t) == 0x1000, "Invalid size of hp_peri0_pms_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
